#encoding: UTF-8
class DrController < ApplicationController

	def counting_years(year, month, number)
		((Time.new - Time.new(year,month,number))/60/60/24/365).to_i
	end

	def counting_days_before_birthday(year, month, number)
		(((Time.new(2014,month,number)) - (Time.new))/60/60/24).to_i
	end

	def index
		m2 = []
		hash_surname_and_days = {}
		hash_surname_and_years = {}
		h = {[1987,10,04] => "Патреев Игорь Иванович", [1972,07,21] => "Петухов Алексей Владимирович", [1983,02,15] => "Алексеева Марина Александровна",
		[1950,05,14] => "Анин Роман Марьянович", [1993,02,19] => "Белоножко Александр Петрович", [1976,02,14] => "Астрейко Ирина Владимировна", 
		[1964,10,13] => "Анашенков Андрей Сергеевич", [1962,8,8] => "Богданович Александр Иванович", [1950,12,02] => "Баньковский Бронислав Павлович", 
		[1961,07,05] => "Бразовский Стас Зигмундович", [1956,01,23] => "Васильков Владимир Михайлович",[1990,06,15] => "Быковская Екатерина Петровна",
		[1937,12,29] => "Воробец Николай Данилович",[1974,07,18] => "Гардевич Олег Алексеевич",[1985,9,18] => "Гетманенко Алеся Викторовна",
		[1964,07,03] => "Головач Юрий Антонович",[1940,01,02] => "Горобец Людмила Сергеевна",[1978,9,17] => "Забагонский Сергей Александрович",
		[1983,01,05] => "Данченко Денис Николаевич",[1951,05,8] => "Демкин Михаил Николаевич",[1958,8,15] => "Девякович Валентина Николаевна",
		[1980,02,9] => "Зарубина Ольга Васильевна",[1957,11,24] => "Жавнерко Владимир Иванович",[1966,10,04] => "Жилко Александр Михайлович",
		[1986,10,8] => "Зозулько Павел Александрович",[1990,04,22] => "Кайгородов Владимир Юрьевич",[1990,12,25] => "Иванова Елена Андреевна",
		[1980,05,06] => "Заяц Наталья Ивановна",[1986,12,18] => "Кириняускене Людмила Александровна",[1954,05,29] => "Ковалева Наталья Павловна",
		[1962,12,9] => "Копанев Вячеслав Сергеевич",[1958,8,06] => "Кожемяка Анатолий Викторович",[1966,05,25] => "Комаровский Сергей Анатольевич",
		[1947,1,22] => "Котова Ванда Вячеславовна",[1965,9,13] => "Красуцкий Валерий Михайлович",[1978,9,23] => "Кравченко Елена Петровна",
		[1985,05,21] => "Лехнович Александр Генадьевич",[1959,12,02] => "Кубрак Тамара Николаевна",[1956,9,05] => "Липинская Тамара Михайловна",
		[1991,11,10] => "Курьянова Кристина Владимировна",[1987,06,24] => "Лобач Василий Владимирович",[1956,12,02] => "Леонов Сергей Васильевич",
		[1979,11,23] => "Литвинова Инна Васильевна",[1980,07,19] => "Логвин Сергей Николаевич",[1988,04,16] => "Мажуль Максим Владимирович",
		[1989,01,31] => "Мазуров Игорь Викторович",[1943,05,11] => "Лузгина Людмила Алексеевна",[1986,10,25] => "Лукашик Дмитрий Евгеньевич",
		[1940,8,05] => "Малинин Николай Кирилович",[1993,04,29] => "Малиновский Станислав Николаевич",[1980,10,07] => "Мациевская Марина Генадьевна",
		[1950,9,10] => "Мисса Евгения Ивановна",[1946,12,03] => "Падалка Галина Алексеевна",[1950,01,10] => "Мисса Петр Петрович",
		[1982,8,06] => "Мациевский Алексей Владимирович",[1987,9,17] => "Небышинец Денис Алексеевич",[1990,8,02] => "Мисса Дарья Петровна",
		[1983,12,9] => "Неберова Юлия Викторовна",[1988,11,04] => "Нескеева Светлана Викторовна",[1958,03,06] => "Рудницкая Надежда Ильинична",
		[1959,9,27] => "Нитов Александр Антонович",[1987,11,16] => "Нищик Сергей Александрович",[1993,02,14] => "Петрович Дарья Сергеевна",
		[1978,05,11] => "Рогова Ольга Александровна",[1984,8,22] => "Савицкий Александр Сергеевич",[1986,04,10] => "Соколов Артем Сергеевич",
		[1985,8,28] => "Святохо Екатерина Ивановна",[1978,12,28] => "Самурганов Ясон Григорьевич",[1982,01,03] => "Титова Майя Александровна",
		[1981,06,02] => "Стрикова Ирина Владимировна",[1978,10,15] => "Тихонович Дмитрий Евгеньевич",[1960,03,24] => "Забело Татьяна Анатольевна",
		[1946,03,05] => "Токарик Люся Васильевна",[1988,12,02] => "Тухто Татьяна Викторовна",[1977,12,21] => "Третьяк Леонид Александрович",
		[1960,12,07] => "Хмелинко Александр Константинович",[1982,02,24] => "Ходос Анна Викторовна",[1959,8,16] => "Шиш Василий
		Иванович",
		[1950,12,13] => "Савченко Людмила Казимировна",[1973,8,21] => "Булгакова Людмила Евгениевна",[1989,02,27] => "Шкель Сергей Александрович",
		[1961,01,18] => "Дортикос Эррера Елена Михайловна",[1978,06,20] => "Якимова Ирина Игоревна",[1965,02,22] => "Заяц Андрей Михайлович",
		[1960,8,05] => "Присяжнюк Анатолий Петрович",[1989,03,21] => "Петлицкий Артем Александрович"}

		h.each do |k,v|
			days = counting_days_before_birthday(k[0],k[1],k[2])
			hash_surname_and_days[days] = v
			hash_surname_and_years[v] = counting_years(k[0],k[1],k[2])
		end

		hash_surname_and_days.sort.each do |key,value|
		if key.to_i >= 0
			m2 << "У следующего(ей) день рождения: " + value.to_s + " через " + key.to_s + " дней." + " Ему(ей) будет: " + (hash_surname_and_years[value]+1).to_s + " лет (года)."
		end
		end
			@a = m2[0]
			@b = m2[1]
			@c = m2[2]
			@d = m2[3]
			@e = m2[4]
	end
end